tylertms/dspic33e-sim/conformance/input_capture.c
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>

#include "device.h"
#include "dspic33.h"

typedef struct {
    uint32_t cases;
    uint32_t passed;
    uint32_t failed;
} InputCaptureConformance;

static const uint8_t capture_irqs[DSPIC33_INPUT_CAPTURE_COUNT] = {
    1u,  5u,   37u,  38u,  39u,  40u,  22u,  23u,
    93u, 125u, 127u, 129u, 135u, 137u, 139u, 141u};

enum {
    CAPTURE_BASE = 0x0140u,
    CAPTURE_STRIDE = 0x0008u,
    CAPTURE_FP_RISING = 0x1c03u,
    CAPTURE_32_BIT = 0x0100u,
    CAPTURE_TRIGGER = 0x00c0u,
    CAPTURE_NOT_EMPTY = 0x0008u,
    CAPTURE_OVERFLOW = 0x0010u,
    CAPTURE_DMA_DESTINATION = 0x3000u,
    CAPTURE_VECTOR = 0x0200u,
    CAPTURE_PMD_LOW = 0x0762u,
    CAPTURE_PMD_HIGH = 0x0768u
};

static void expect(InputCaptureConformance* state, bool condition, const char* name) {
    state->cases++;
    if (condition) {
        state->passed++;
    } else {
        state->failed++;
        printf("[input-capture-failed] %s\n", name);
    }
}

static uint16_t capture_base(uint8_t channel) {
    return (uint16_t)(CAPTURE_BASE + channel * CAPTURE_STRIDE);
}

static uint16_t capture_pmd_address(uint8_t channel) {
    return channel < 8u ? CAPTURE_PMD_LOW : CAPTURE_PMD_HIGH;
}

static uint16_t capture_pmd_mask(uint8_t channel) {
    return (uint16_t)(1u << (8u + channel % 8u));
}

static bool interrupt_flag(Dspic33* cpu, uint8_t channel) {
    uint8_t irq = capture_irqs[channel];
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    return (dspic33_read_word(cpu, address) & (uint16_t)(1u << (irq % 16u))) != 0u;
}

static void clear_interrupt(Dspic33* cpu, uint8_t channel) {
    uint8_t irq = capture_irqs[channel];
    uint16_t address = (uint16_t)(0x0800u + (irq / 16u) * 2u);
    uint16_t bit = (uint16_t)(1u << (irq % 16u));
    dspic33_write_word(cpu, address,
                       (uint16_t)(dspic33_read_word(cpu, address) & ~bit));
}

static void configure_capture(Dspic33* cpu, uint8_t channel, uint8_t interval,
                              bool paired) {
    uint16_t base = capture_base(channel);
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u),
                       (uint16_t)(CAPTURE_TRIGGER | (paired ? CAPTURE_32_BIT : 0u)));
    clear_interrupt(cpu, channel);
    dspic33_write_word(cpu, base, (uint16_t)(CAPTURE_FP_RISING | (interval << 5u)));
}

static bool rising_edge(Dspic33* cpu, uint8_t channel) {
    return dspic33_input_capture_input(cpu, channel, false, 0u) &&
           dspic33_device_advance(cpu, 0u) &&
           dspic33_input_capture_input(cpu, channel, true, 0u) &&
           dspic33_device_advance(cpu, 1u);
}

static bool set_level(Dspic33* cpu, uint8_t channel, bool high) {
    return dspic33_input_capture_input(cpu, channel, high, 0u) &&
           dspic33_device_advance(cpu, 1u);
}

static void configure_dma(Dspic33* cpu, uint8_t request, uint16_t pad,
                          uint16_t destination) {
    dspic33_write_word(cpu, 0x0b00u, 0u);
    dspic33_write_word(cpu, 0x0b02u, request);
    dspic33_write_word(cpu, 0x0b04u, destination);
    dspic33_write_word(cpu, 0x0b06u, 0u);
    dspic33_write_word(cpu, 0x0b0cu, pad);
    dspic33_write_word(cpu, 0x0b0eu, 0u);
    dspic33_write_word(cpu, 0x0b00u, 0x8001u);
}

static void access_cases(InputCaptureConformance* state, Dspic33* cpu) {
    uint8_t channel;
    dspic33_reset(cpu, 0u);
    for (channel = 0u; channel < DSPIC33_INPUT_CAPTURE_COUNT; channel++) {
        uint16_t base = capture_base(channel);
        expect(state, dspic33_read_word(cpu, base) == 0u, "ICCON1 reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0x000du,
               "ICCON2 reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0u,
               "ICBUF deterministic empty reset");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0u,
               "ICTMR deterministic reset");
        dspic33_write_word(cpu, base, 0xffffu);
        dspic33_write_word(cpu, (uint16_t)(base + 2u), 0xffffu);
        dspic33_write_word(cpu, (uint16_t)(base + 4u), 0xffffu);
        dspic33_write_word(cpu, (uint16_t)(base + 6u), 0xffffu);
        expect(state, dspic33_read_word(cpu, base) == 0x3c67u, "ICCON1 access mask");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 2u)) == 0x01dfu,
               "ICCON2 access mask");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == 0u,
               "ICBUF read only");
        expect(state, dspic33_read_word(cpu, (uint16_t)(base + 6u)) == 0u,
               "ICTMR read only");
    }
}

static void fifo_cases(InputCaptureConformance* state, Dspic33* cpu) {
    uint8_t channel;
    for (channel = 0u; channel < DSPIC33_INPUT_CAPTURE_COUNT; channel++) {
        uint16_t base = capture_base(channel);
        uint8_t sample;
        dspic33_reset(cpu, 0u);
        configure_capture(cpu, channel, 3u, false);
        for (sample = 0u; sample < DSPIC33_INPUT_CAPTURE_FIFO_SIZE; sample++) {
            expect(state, rising_edge(cpu, channel), "capture FIFO edge");
        }
        expect(state, cpu->io.input_capture.fifo[channel].count == 4u,
               "capture FIFO fills to four");
        expect(state,
               (dspic33_read_word(cpu, base) & CAPTURE_NOT_EMPTY) != 0u &&
                   (dspic33_read_word(cpu, base) & CAPTURE_OVERFLOW) == 0u,
               "capture FIFO status before overflow");
        expect(state,
               cpu->io.input_capture.fifo[channel]
                       .words[cpu->io.input_capture.fifo[channel].head] == 1u,
               "capture FIFO exposes oldest word");
        expect(state, rising_edge(cpu, channel), "capture overflow edge");
        expect(state,
               cpu->io.input_capture.fifo[channel].count == 4u &&
                   (dspic33_read_word(cpu, base) & CAPTURE_OVERFLOW) != 0u,
               "fifth capture sets overflow and preserves FIFO");
        dspic33_write_word(cpu, base, (uint16_t)(CAPTURE_FP_RISING | (3u << 5u)));
        expect(
            state,
            (dspic33_read_word(cpu, base) & (CAPTURE_NOT_EMPTY | CAPTURE_OVERFLOW)) ==
                (CAPTURE_NOT_EMPTY | CAPTURE_OVERFLOW),
            "status bits ignore software writes");
        expect(state, !interrupt_flag(cpu, channel),
               "fourth capture interrupt remains delayed");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance capture interrupt delay");
        expect(state, interrupt_flag(cpu, channel),
               "fourth capture raises channel interrupt");
        for (sample = 0u; sample < DSPIC33_INPUT_CAPTURE_FIFO_SIZE; sample++) {
            expect(state, dspic33_read_word(cpu, (uint16_t)(base + 4u)) == sample + 1u,
                   "capture FIFO preserves order");
        }
        expect(state,
               cpu->io.input_capture.fifo[channel].count == 0u &&
                   (dspic33_read_word(cpu, base) &
                    (CAPTURE_NOT_EMPTY | CAPTURE_OVERFLOW)) == 0u,
               "empty read clears FIFO status");
    }
}

static void interrupt_rate_cases(InputCaptureConformance* state, Dspic33* cpu) {
    uint8_t interval;
    for (interval = 0u; interval < 4u; interval++) {
        uint8_t sample;
        dspic33_reset(cpu, 0u);
        configure_capture(cpu, 0u, interval, false);
        for (sample = 0u; sample <= interval; sample++) {
            expect(state, rising_edge(cpu, 0u), "capture interrupt-rate edge");
            expect(state, !interrupt_flag(cpu, 0u),
                   "capture interrupt not raised on FIFO write");
        }
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance first interrupt-delay cycle");
        expect(state, !interrupt_flag(cpu, 0u), "capture interrupt waits two cycles");
        expect(state, dspic33_device_advance(cpu, 1u),
               "advance second interrupt-delay cycle");
        expect(state, interrupt_flag(cpu, 0u),
               "capture interrupt follows selected interval");
    }
}

static void zero_interval_overflow_cases(InputCaptureConformance* state, Dspic33* cpu) {
    uint8_t sample;
    dspic33_reset(cpu, 0u);
    configure_capture(cpu, 0u, 0u, false);
    for (sample = 0u; sample < DSPIC33_INPUT_CAPTURE_FIFO_SIZE; sample++) {
        expect(state, rising_edge(cpu, 0u), "ICI zero FIFO edge");
    }
    expect(state, dspic33_device_advance(cpu, 2u), "drain ICI zero interrupt delay");
    clear_interrupt(cpu, 0u);
    configure_dma(cpu, capture_irqs[0], 0x0144u, CAPTURE_DMA_DESTINATION);
    expect(state, rising_edge(cpu, 0u), "ICI zero overflow edge");
    expect(
        state,
        cpu->io.input_capture.fifo[0].count == 3u &&
            (dspic33_read_word(cpu, 0x0140u) & CAPTURE_OVERFLOW) == 0u &&
            cpu->io.input_capture.fifo[0].words[cpu->io.input_capture.fifo[0].head] ==
                2u,
        "ICI zero fifth capture discards sample without overflow");
    expect(state,
           dspic33_read_word(cpu, CAPTURE_DMA_DESTINATION) == 1u &&
               !interrupt_flag(cpu, 0u),
           "ICI zero overflow preserves immediate DMA and delayed interrupt");
    expect(state, dspic33_device_advance(cpu, 1u), "complete ICI zero overflow DMA");
    expect(state, !interrupt_flag(cpu, 0u),
           "ICI zero overflow interrupt waits two cycles");
    expect(state, dspic33_device_advance(cpu, 1u),
           "complete ICI zero overflow interrupt delay");
    expect(state, interrupt_flag(cpu, 0u),
           "ICI zero overflow still raises capture interrupt");
}

static void mode_cases(InputCaptureConformance* state, Dspic33* cpu) {
    uint16_t base = capture_base(0u);
    uint8_t edge;
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1803u);
    expect(state, rising_edge(cpu, 0u), "non-FP edge advances");
    expect(state, cpu->io.input_capture.fifo[0].count == 0u,
           "non-FP timer source is excluded");
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x00c1u);
    dspic33_write_word(cpu, base, CAPTURE_FP_RISING);
    expect(state, rising_edge(cpu, 0u), "nonsoftware sync edge advances");
    expect(state, cpu->io.input_capture.fifo[0].count == 0u,
           "hardware sync source is excluded");
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), 0x0080u);
    dspic33_write_word(cpu, base, CAPTURE_FP_RISING);
    expect(state, rising_edge(cpu, 0u), "inactive trigger edge advances");
    expect(state,
           cpu->io.input_capture.fifo[0].count == 1u &&
               cpu->io.input_capture.fifo[0].words[0] == 0u &&
               cpu->io.input_capture.timer[0] == 0u,
           "cleared trigger status captures held-zero timer");
    dspic33_write_word(cpu, base, 0u);
    expect(state, set_level(cpu, 0u, false), "seed every-edge input low");
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1c01u);
    expect(state, set_level(cpu, 0u, true) && set_level(cpu, 0u, false),
           "every-edge capture transitions advance");
    expect(state,
           cpu->io.input_capture.fifo[0].count == 2u &&
               cpu->io.input_capture.fifo[0].words[0] == 1u &&
               cpu->io.input_capture.fifo[0].words[1] == 2u,
           "every-edge mode captures rising and falling transitions");
    dspic33_write_word(cpu, base, 0u);
    expect(state, set_level(cpu, 0u, false), "seed every-edge interrupt input low");
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1c61u);
    expect(state, set_level(cpu, 0u, true), "every-edge interrupt event advances");
    expect(state, dspic33_device_advance(cpu, 2u),
           "every-edge interrupt delay advances");
    expect(state, interrupt_flag(cpu, 0u),
           "every-edge mode ignores capture interrupt interval");
    clear_interrupt(cpu, 0u);
    expect(state,
           set_level(cpu, 0u, false) && set_level(cpu, 0u, true) &&
               set_level(cpu, 0u, false),
           "every-edge FIFO reaches four entries");
    expect(state, set_level(cpu, 0u, true), "every-edge overflow event advances");
    expect(state,
           cpu->io.input_capture.fifo[0].count == 4u &&
               (dspic33_read_word(cpu, base) & CAPTURE_OVERFLOW) == 0u,
           "every-edge overflow discards sample without ICOV");

    dspic33_write_word(cpu, base, 0u);
    expect(state, set_level(cpu, 0u, false), "seed fourth-edge input low");
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1c02u);
    expect(state, set_level(cpu, 0u, true) && set_level(cpu, 0u, false),
           "falling capture transitions advance");
    expect(state,
           cpu->io.input_capture.fifo[0].count == 1u &&
               cpu->io.input_capture.fifo[0].words[0] == 2u,
           "falling mode captures only falling transitions");

