tylertms/dspic33e-sim/conformance/input_capture.c
    configure_capture(cpu, 0u, 0u, false);
    expect(state, rising_edge(cpu, 0u), "supported rising edge advances");
    expect(state, cpu->io.input_capture.fifo[0].count == 1u,
           "FP software-triggered rising capture succeeds");

    dspic33_write_word(cpu, base, 0u);
    expect(state, set_level(cpu, 0u, false), "seed sixteenth-edge input low");
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1c04u);
    for (edge = 0u; edge < 3u; edge++) {
        expect(state, set_level(cpu, 0u, true) && set_level(cpu, 0u, false),
               "fourth-edge prescaler advances below threshold");
    }
    expect(state, cpu->io.input_capture.fifo[0].count == 0u,
           "fourth-edge prescaler suppresses first three rising edges");
    expect(state, set_level(cpu, 0u, true), "fourth rising edge advances");
    expect(state,
           cpu->io.input_capture.fifo[0].count == 1u &&
               cpu->io.input_capture.fifo[0].words[0] == 7u,
           "fourth-edge prescaler captures fourth rising edge");

    dspic33_write_word(cpu, base, 0u);
    expect(state, set_level(cpu, 0u, false), "seed switched prescaler input low");
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1c05u);
    for (edge = 0u; edge < 15u; edge++) {
        expect(state, set_level(cpu, 0u, false) && set_level(cpu, 0u, true),
               "sixteenth-edge prescaler advances below threshold");
    }
    expect(state, cpu->io.input_capture.fifo[0].count == 0u,
           "sixteenth-edge prescaler suppresses first fifteen rising edges");
    expect(state, set_level(cpu, 0u, false) && set_level(cpu, 0u, true),
           "sixteenth rising edge advances");
    expect(state, cpu->io.input_capture.fifo[0].count == 1u,
           "sixteenth-edge prescaler captures sixteenth rising edge");

    dspic33_write_word(cpu, base, 0u);
    expect(state, set_level(cpu, 0u, false), "seed unused-mode input low");
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1c04u);
    for (edge = 0u; edge < 3u; edge++) {
        expect(state, set_level(cpu, 0u, false) && set_level(cpu, 0u, true),
               "active-mode prescaler advances before mode switch");
    }
    dspic33_write_word(cpu, base, 0x1c05u);
    for (edge = 0u; edge < 13u; edge++) {
        expect(state, set_level(cpu, 0u, false) && set_level(cpu, 0u, true),
               "active-mode prescaler advances after mode switch");
    }
    expect(state, cpu->io.input_capture.fifo[0].count == 1u,
           "active-mode switch preserves prescaler count");

    dspic33_write_word(cpu, base, 0u);
    expect(state, set_level(cpu, 0u, false), "seed reverse prescaler input low");
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1c05u);
    for (edge = 0u; edge < 5u; edge++) {
        expect(state, set_level(cpu, 0u, true) && set_level(cpu, 0u, false),
               "sixteenth-edge prescaler advances before reverse switch");
    }
    dspic33_write_word(cpu, base, 0x1c04u);
    for (edge = 0u; edge < 2u; edge++) {
        expect(state, set_level(cpu, 0u, true) && set_level(cpu, 0u, false),
               "fourth-edge prescaler advances below next phase boundary");
    }
    expect(state, cpu->io.input_capture.fifo[0].count == 0u,
           "reverse mode switch retains nonzero prescaler phase");
    expect(state, set_level(cpu, 0u, true),
           "fourth-edge prescaler reaches next phase boundary");
    expect(state, cpu->io.input_capture.fifo[0].count == 1u,
           "reverse active-mode switch captures at finite next boundary");

    dspic33_write_word(cpu, base, 0u);
    expect(state, set_level(cpu, 0u, false), "seed reset prescaler input low");
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1c04u);
    for (edge = 0u; edge < 3u; edge++) {
        expect(state, set_level(cpu, 0u, true) && set_level(cpu, 0u, false),
               "prescaler advances before module disable");
    }
    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, base, 0x1c04u);
    expect(state, set_level(cpu, 0u, true),
           "prescaler advances after module re-enable");
    expect(state, cpu->io.input_capture.fifo[0].count == 0u,
           "module disable clears prescaler count");

    dspic33_write_word(cpu, base, 0u);
    dspic33_write_word(cpu, (uint16_t)(base + 2u), CAPTURE_TRIGGER);
    dspic33_write_word(cpu, base, 0x1c06u);
    expect(state, set_level(cpu, 0u, false) && set_level(cpu, 0u, true),
           "unused capture mode edge advances");
    expect(state, cpu->io.input_capture.fifo[0].count == 0u,
           "unused capture mode remains disabled");
}

static void configure_capture_interrupt(Dspic33* cpu, uint8_t channel) {
    uint8_t irq = capture_irqs[channel];
    uint16_t enable = (uint16_t)(0x0820u + (irq / 16u) * 2u);
    uint16_t priority = (uint16_t)(0x0840u + (irq / 4u) * 2u);
    uint16_t shift = (uint16_t)((irq % 4u) * 4u);
    dspic33_write_word(
        cpu, enable,
        (uint16_t)(dspic33_read_word(cpu, enable) | (uint16_t)(1u << (irq % 16u))));
    dspic33_write_word(
        cpu, priority,
        (uint16_t)((dspic33_read_word(cpu, priority) & ~(uint16_t)(7u << shift)) |
                   (uint16_t)(3u << shift)));
    cpu->program[(0x0014u + irq * 2u) / 2u] = CAPTURE_VECTOR;
    cpu->w[15] = 0x1800u;
}

static void power_cases(InputCaptureConformance* state, Dspic33* cpu) {
    uint16_t base = capture_base(0u);

    dspic33_reset(cpu, 0u);
    configure_capture(cpu, 0u, 0u, false);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state, set_level(cpu, 0u, true), "sleep rising capture edge advances");
    expect(state, cpu->io.input_capture.fifo[0].count == 0u && !interrupt_flag(cpu, 0u),
           "normal capture mode stops in Sleep");

    dspic33_reset(cpu, 0u);
    configure_capture(cpu, 0u, 0u, false);
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state, set_level(cpu, 0u, true), "idle-running capture edge advances");
    expect(state, cpu->io.input_capture.fifo[0].count == 1u,
           "ICSIDL clear continues capture in Idle");

    dspic33_reset(cpu, 0u);
    configure_capture(cpu, 0u, 0u, false);
    dspic33_write_word(cpu, base, (uint16_t)(CAPTURE_FP_RISING | 0x2000u));
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state, set_level(cpu, 0u, true), "idle-stopped capture edge advances");
    expect(state, cpu->io.input_capture.fifo[0].count == 0u,
           "ICSIDL set stops normal capture in Idle");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, base, 7u);
    configure_capture_interrupt(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_ACTIVE;
    expect(state, set_level(cpu, 0u, true), "active interrupt-only edge advances");
    expect(state, !interrupt_flag(cpu, 0u) && cpu->io.input_capture.fifo[0].count == 0u,
           "interrupt-only mode is inactive outside Sleep and Idle");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, base, 7u);
    configure_capture_interrupt(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_SLEEP;
    expect(state, set_level(cpu, 0u, true), "sleep interrupt-only edge advances");
    expect(state, interrupt_flag(cpu, 0u) && cpu->io.input_capture.fifo[0].count == 0u,
           "interrupt-only Sleep edge raises IRQ without FIFO data");
    expect(state,
           dspic33_device_advance(cpu, 1u) && dspic33_device_wake(cpu) &&
               cpu->last_interrupt == capture_irqs[0] && cpu->pc == CAPTURE_VECTOR,
           "interrupt-only Sleep edge wakes through capture vector");

    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, base, 7u);
    configure_capture_interrupt(cpu, 0u);
    cpu->power_state = DSPIC33_POWER_IDLE;
    expect(state, set_level(cpu, 0u, true), "idle interrupt-only edge advances");
    expect(state, interrupt_flag(cpu, 0u) && cpu->io.input_capture.fifo[0].count == 0u,
           "interrupt-only Idle edge raises IRQ without FIFO data");
}

static void paired_firmware_case(InputCaptureConformance* state, Dspic33* cpu,
                                 uint8_t channel, uint8_t pin, uint16_t pps_register) {
    uint16_t first = capture_base(channel);
    uint16_t second = capture_base((uint8_t)(channel + 1u));
    dspic33_reset(cpu, 0u);
    dspic33_write_word(cpu, pps_register, pin);
    configure_capture(cpu, channel, 1u, true);
    configure_capture(cpu, (uint8_t)(channel + 1u), 1u, true);
    configure_capture_interrupt(cpu, channel);
    expect(state, dspic33_input_capture_pin(cpu, (uint8_t)(pin + 1u), true, 0u),
           "queue unmapped PPS edge");
    expect(state, dspic33_device_advance(cpu, 1u), "advance unmapped PPS edge");
    expect(state,
           cpu->io.input_capture.fifo[channel].count == 0u &&
               cpu->io.input_capture.fifo[channel + 1u].count == 0u,
           "unmapped PPS edge does not capture");
    expect(state, dspic33_input_capture_pin(cpu, pin, false, 0u),
           "queue mapped PPS low state");
    expect(state, dspic33_device_advance(cpu, 65534u),
           "advance paired counter toward wrap");
    expect(state, dspic33_input_capture_pin(cpu, pin, true, 0u),
           "queue first mapped PPS edge");
    expect(state, dspic33_device_advance(cpu, 1u), "capture first paired edge");
    expect(state,
           cpu->io.input_capture.fifo[channel].count == 1u &&
               cpu->io.input_capture.fifo[channel + 1u].count == 1u &&
               cpu->io.input_capture.fifo[channel].words[0] == 0u &&
               cpu->io.input_capture.fifo[channel + 1u].words[0] == 1u,
           "paired FIFO captures 32-bit wrap value");
    expect(state, !interrupt_flag(cpu, channel),
           "first paired capture does not meet ICI interval");
    expect(state, dspic33_input_capture_pin(cpu, pin, false, 0u),
           "queue paired falling state");
    expect(state, dspic33_device_advance(cpu, 0u), "apply paired falling state");
    expect(state, dspic33_input_capture_pin(cpu, pin, true, 0u),
           "queue second mapped PPS edge");
    expect(state, dspic33_device_advance(cpu, 1u), "capture second paired edge");
    expect(state, !interrupt_flag(cpu, channel),
           "paired interrupt remains delayed after FIFO write");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance paired interrupt first cycle");
    expect(state, !interrupt_flag(cpu, channel), "paired interrupt waits second cycle");
    expect(state, dspic33_device_advance(cpu, 1u),
           "advance paired interrupt second cycle");
    expect(state, interrupt_flag(cpu, channel) && dspic33_device_interrupt_pending(cpu),
           "paired channel IRQ becomes pending");
    expect(state,
           dspic33_device_service_interrupt(cpu) &&
               cpu->last_interrupt == capture_irqs[channel] &&
               cpu->pc == CAPTURE_VECTOR,
           "paired firmware channel vectors");
    expect(state, dspic33_read_word(cpu, (uint16_t)(first + 4u)) == 0u,
           "paired low FIFO first word");
    expect(state, dspic33_read_word(cpu, (uint16_t)(second + 4u)) == 1u,
           "paired high FIFO first word");
    expect(state, dspic33_read_word(cpu, (uint16_t)(first + 4u)) == 1u,
           "paired low FIFO second word");
    expect(state, dspic33_read_word(cpu, (uint16_t)(second + 4u)) == 1u,
           "paired high FIFO second word");
}

static void paired_cases(InputCaptureConformance* state, Dspic33* cpu) {
    paired_firmware_case(state, cpu, 0u, 17u, 0x06aeu);
    paired_firmware_case(state, cpu, 2u, 78u, 0x06b0u);
}

